{
  "backend/main.mo": "Motoko backend actor handling authorization, user profiles, product defaults, and order storage with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to involved frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining warm OKLCH color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "HTML entry for the PWA including meta tags, manifest link, theme color, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, start URL, and standalone display mode.",
  "frontend/src/App.tsx": "Main React app with router setup, header/footer layout, navigation, cart badge, and integrated Add‑to‑Home‑Screen UI.",
  "frontend/src/components/AddToHomeScreen.tsx": "Component showing install button or iOS instructions based on PWA installability state.",
  "frontend/src/config/payment.ts": "Frontend config and utilities for optional UPI-style online payment settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useAddToHomeScreen.ts": "Provides PWA install prompt handling, tracking installability, installation state, and iOS detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines product, order, admin, and price update queries and mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and theme styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminRatesPage.tsx": "Admin UI for viewing, refreshing, and updating product prices with authentication and error handling.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with live pricing, quantity controls, and handling of missing products.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout form with validation, payment link handling, price calculation, and order creation before redirecting to confirmation.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, business hours, and a brief brand description.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage hero banner, product highlights, and navigation links to products and contact pages.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Fetches and displays confirmed order details with copyable pickup note and Rapido booking link.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Provides order lookup by ID with input validation and displays fetched order details.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and lists dairy and frozen dessert products with add-to-cart functionality and loading/error states.",
  "frontend/src/state/cart/CartContext.tsx": "Provides a React context for cart state with add, update, remove, clear, total, count, and price‑sync functionality persisted in sessionStorage.",
  "frontend/src/state/cart/cartTypes.ts": "Defines the CartItemType interface containing productName, price, and quantity.",
  "frontend/src/utils/cartPricing.ts": "Calculates cart totals using latest product prices and flags missing items, returning enriched pricing info.",
  "frontend/src/utils/payment.ts": "Builds UPI payment deep-link URLs and formats payment notes for orders.",
  "frontend/src/utils/rapidoPickupNote.ts": "Generates a formatted pickup note for Rapido containing order details and item list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project metadata describing scope, requirements, features, issues, and architectural notes for the DAIRY FIELD app."
}