{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus product and order types and storage.",
  "feature_evidence.json": "Feature evidence report mapping payment‑flow changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files across pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind-based global theme definitions using warm OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, manifest, icons, and script bootstrap.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying branding, colors, icons, and standalone display settings.",
  "frontend/src/App.tsx": "Main React app routing layout with navigation, cart badge, admin UI gating, and footer.",
  "frontend/src/components/AddToHomeScreen.tsx": "Component showing install prompts or iOS instructions based on PWA installability state.",
  "frontend/src/components/AdminOrderMessageBanner.tsx": "Alert banner for admins informing them about new order visibility in the management system.",
  "frontend/src/components/PaymentDetailsSection.tsx": "Displays payment method, optional payee details, and transaction reference using a card layout.",
  "frontend/src/config/payment.ts": "Defines frontend payment config and helpers to check configuration and get the default payee.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAddToHomeScreen.ts": "Provides installability detection and prompting logic for adding the PWA to the home screen.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading stored identities, handling login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend queries and mutations for products, orders, profiles, and admin checks using react-query.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light/dark themes with a dairy-focused color palette.",
  "frontend/src/main.tsx": "Bootstraps the app with React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminRatesPage.tsx": "Admin UI for authenticating, viewing, editing, refreshing, and saving product prices with Internet Identity.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, handles loading/errors, displays items with updated prices, and allows clearing or editing the cart.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including form fields, profile autofill, payment instructions, cart validation, and order creation.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, business hours, and a brief business description.",
  "frontend/src/pages/HomePage.tsx": "Provides the landing page with hero banner, feature highlights, and links to shop or contact.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details, payment info, pickup note generation, and error handling.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Lets users look up orders by ID, validates input, fetches order data, and displays order and payment details.",
  "frontend/src/pages/ProductsPage.tsx": "Displays products with loading, error, and category filtering, and allows adding items to the cart.",
  "frontend/src/state/cart/CartContext.tsx": "Provides cart state management with add/remove/update, persistence, totals, and price syncing.",
  "frontend/src/state/cart/cartTypes.ts": "Defines the CartItemType interface for cart items.",
  "frontend/src/utils/cartPricing.ts": "Calculates cart totals and latest prices, marking missing products and computing line totals.",
  "frontend/src/utils/payment.ts": "Validates payee info, builds UPI deep links, and formats structured payment details for order notes.",
  "frontend/src/utils/rapidoPickupNote.ts": "Generates a formatted pickup note for Rapido containing order metadata and item list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin setup.",
  "project_state.json": "Tracks project state, requirements, and issues related to replacing UPI payments with a GPay-only flow."
}