{
  "backend/main.mo": "Motoko backend actor handling user profiles, product catalog defaults, and order storage with access control enforcement.",
  "feature_evidence.json": "Feature evidence report mapping new order-details and routing work to affected files, components, and requirements.",
  "frontend-file-summaries.txt": "Lookup table containing short descriptions of major frontend files for build and documentation purposes.",
  "frontend/index.css": "Tailwind base theme defining warm OKLCH color variables and global styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup, navigation menu, layout, and routes including order tracking and admin pages.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches the backend actor, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, orders, admin status, and for updating product prices and creating orders using an actor API.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines light and dark theme CSS variables for colors, borders, and UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads the main App component.",
  "frontend/src/pages/AdminRatesPage.tsx": "Admin UI for logging in, viewing products, editing their prices individually or in bulk, and refreshing data.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, recalculates prices using latest product data, and allows item quantity management and removal.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays checkout form, validates user input, recalculates cart prices, and submits orders through the createOrder mutation.",
  "frontend/src/pages/ContactPage.tsx": "Shows business contact details, hours, and a brief description of the dairy brand.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, features, and navigation to products and contact pages.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays confirmation details for a specific order, including customer info and ordered items.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Provides an order lookup form and shows detailed order information after validating and fetching by ID.",
  "frontend/src/pages/ProductsPage.tsx": "Fetches and displays dairy and frozen dessert products with add‑to‑cart support and loading/error states.",
  "frontend/src/state/cart/CartContext.tsx": "Implements cart state management with add, update, remove, total, count, syncing, and session storage persistence.",
  "frontend/src/state/cart/cartTypes.ts": "Defines the CartItemType interface specifying product name, price, and quantity.",
  "frontend/src/utils/cartPricing.ts": "Calculates cart totals using latest product prices and flags missing products in pricing results.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, container settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Stores the project’s current state, feature list, and known issues for the DAIRY FIELD online store build."
}