{
  "backend/main.mo": "Motoko canister managing user profiles with access control and providing product defaults plus order creation and retrieval logic.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base definitions with warm OKLCH color variables for light and dark themes and global styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, manifest, icons, and script bootstrap.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and maskable icons.",
  "frontend/src/App.tsx": "Main React router setup with customer and admin layouts, navigation, context providers, and global UI elements.",
  "frontend/src/components/AddToHomeScreen.tsx": "Component showing install prompts or instructions for adding the PWA to a device's home screen.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "Displays an access denied message with an alert and a button redirecting to home.",
  "frontend/src/components/admin/AdminLayout.tsx": "Provides the admin panel layout, navigation, and dynamic page selection based on route.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks admin status and either shows children, a loader, or an access denied screen.",
  "frontend/src/components/AdminOrderMessageBanner.tsx": "Admin banner showing new-order alerts with actions to view or mark orders as seen using polling.",
  "frontend/src/components/PaymentDetailsSection.tsx": "Renders a card showing payment method, optional payee info, and transaction reference.",
  "frontend/src/config/payment.ts": "Defines frontend payment configuration, payee options, and helper functions for defaults and validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAddToHomeScreen.ts": "Handles PWA install prompt availability, iOS detection, and triggering the install flow.",
  "frontend/src/hooks/useAdminOrdersPolling.ts": "Fetches and refetches admin order data and computes the count of new orders.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query for products, orders, and order creation logic.",
  "frontend/src/index.css": "Tailwind setup defining light/dark theme variables and base styles for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminOrderDetailsPage.tsx": "Displays detailed order info for admins, including payment, notes, and copyable pickup data, with loading and error handling.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Lists all orders for admins with sorting, last-seen tracking, and navigation to order detail pages.",
  "frontend/src/pages/AdminProductsPage.tsx": "Provides admin interfaces for creating products, bulk uploading, and managing authentication state.",
  "frontend/src/pages/AdminRatesPage.tsx": "Allows admins to update individual or multiple product prices with authentication and refresh controls.",
  "frontend/src/pages/CartPage.tsx": "Shows the user's cart with latest product prices, missing-product alerts, and options to edit or clear the cart.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including cart validation, user profile prefill, payment instructions, and order creation for authenticated and guest users.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, business hours, and a brief description of the dairy brand.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage hero, product highlights, and navigation to products and contact pages.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Fetches and displays order confirmation details, payment info, errors, and clipboard actions based on an order ID.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Allows admins to search and view detailed order information including payment and notes.",
  "frontend/src/pages/ProductsPage.tsx": "Loads and displays the product catalog with add‑to‑cart support and error handling including retries.",
  "frontend/src/state/cart/CartContext.tsx": "Manages cart state with add/update/remove, syncs to sessionStorage, and exposes totals via React context.",
  "frontend/src/state/cart/cartTypes.ts": "Defines the CartItemType interface with product name, price, and quantity.",
  "frontend/src/utils/adminLastSeenOrders.ts": "Stores and retrieves admin last-seen order metadata and counts new orders based on timestamps.",
  "frontend/src/utils/cartPricing.ts": "Calculates cart totals using latest product prices and flags missing products.",
  "frontend/src/utils/errorDisplay.ts": "Normalizes various error types into safe display strings and formats them with optional prefixes.",
  "frontend/src/utils/payment.ts": "Validates payee info, builds Google Pay deep links, and formats structured payment notes.",
  "frontend/src/utils/productUpload.ts": "Parses product uploads from JSON or CSV, validates fields, and converts prices to BigInt.",
  "frontend/src/utils/rapidoPickupNote.ts": "Generates a formatted pickup note for Rapido containing order details and item list.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL/session parameters, including hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state for fixing product loading failures, including known issues, existing features, and a new backend fix request. Contains metadata like schema versions, project name, and clarification settings."
}