{
  "kind": "build_request",
  "title": "Replace broken UPI-ID payments with Google Pay-only payment to 9494237076",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the payment configuration so the app offers only one online payment option: Google Pay to phone number 9494237076 (remove the UPI ID option entirely and make Google Pay the default).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "online payment not working by upi id please add only gpay option only on 9494237076 with easy way for customer"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/config/payment.ts, PAYMENT_CONFIG.payees contains only one payee: id='gpay-phone', type='phone', value='9494237076'.",
        "PAYMENT_CONFIG.defaultPayeeId is set to 'gpay-phone' (or omitted while still defaulting to 'gpay-phone').",
        "No UPI ID payee (e.g., 'aliwaris@sbi') is present anywhere in the selectable options on the Checkout page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Simplify the checkout payment UI to a Google Pay-only flow that is easy for customers: remove the 'Pay To' dropdown, prominently show the Google Pay number (9494237076), provide one-tap copy actions, and avoid any UPI-ID-specific validation/error messaging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "please add only gpay option only on 9494237076 with easy way for customer"
        ]
      },
      "acceptanceCriteria": [
        "On frontend/src/pages/CheckoutPage.tsx, the payment section no longer renders a Select dropdown for payees.",
        "The payment section displays the payee label and phone number 9494237076 in a prominent, copy-friendly format.",
        "The payment section includes a 'Copy Google Pay Number' action that copies '9494237076' to the clipboard and provides visible confirmation (toast or inline message).",
        "The payment section includes a 'Copy Amount' action that copies the exact total amount (e.g., '₹123' or '123') to the clipboard and provides visible confirmation.",
        "Clicking the primary payment CTA does not call buildUpiDeepLink with a configuration that can produce the current error 'Phone numbers cannot be used for UPI payment links.'"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure order records continue to store and display structured payment details for the Google Pay phone option (method, payee label/value, optional transaction reference) on the Order Confirmation and Order Details views.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "online payment not working by upi id please add only gpay option only on 9494237076"
        ]
      },
      "acceptanceCriteria": [
        "When an order is placed, the notes include a [PAYMENT_INFO] block produced by formatPaymentInfoForNotes with PayeeType='phone', PayeeLabel indicating Google Pay, and PayeeValue='9494237076'.",
        "On frontend/src/pages/OrderConfirmationPage.tsx, PaymentDetailsSection renders the Google Pay label and phone number when the order contains the structured payment info.",
        "On frontend/src/pages/OrderDetailsPage.tsx, payment details render consistently with Order Confirmation when structured payment info exists.",
        "The transaction reference field remains optional and, when provided, is shown in PaymentDetailsSection."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Keep backend architecture as a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Integrating external payment gateways (e.g., Stripe, Razorpay) or verifying payment status automatically.",
    "Adding multiple UPI apps/options beyond Google Pay.",
    "Changing product/catalog or cart pricing logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}