{
  "kind": "build_request",
  "title": "Fix product catalog failing to load (robust actor initialization + clearer error recovery)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make product loading resilient to actor initialization failures so the public product catalog can still load even when admin access-control initialization fails (e.g., missing/invalid `caffeineAdminToken`). Specifically, update the frontend actor creation flow to not hard-fail product queries when `_initializeAccessControlWithSecret` throws/traps; instead, allow creating/using the actor for public methods like `listProducts()` and surface any admin-init failure only where admin features are used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "Opening the Products page successfully loads and renders the product list for an anonymous user.",
        "Opening the Products page successfully loads and renders the product list for an authenticated (Internet Identity) user even when `caffeineAdminToken` is missing or invalid.",
        "A failure in `_initializeAccessControlWithSecret` does not prevent React Query `useProducts()` from calling `actor.listProducts()`.",
        "Admin-only pages/controls still correctly require admin status; lack of admin initialization does not incorrectly grant admin access."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the product-load error diagnostics and recovery UX so users can understand whether the failure is a backend connection problem vs. a product-fetch problem, and can reliably retry. Ensure the error message shown on the Products page remains in English and includes a safe, sanitized error string.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "When product loading fails, the Products page shows an English error title and description and displays `sanitizeError(error)` output.",
        "The Retry button triggers a refetch and properly transitions through a retrying/loading state without requiring a full page reload.",
        "Console logs for product fetch clearly indicate whether the failure occurred during actor initialization or during `listProducts()` execution."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend public product listing endpoint (`listProducts`) remains publicly accessible and consistently returns a stable array of products without trapping for normal conditions (including when the product map is non-empty). Add minimal backend-side logging/trap prevention only if needed to stop sporadic failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "`listProducts()` can be called successfully without authentication and returns the current product list.",
        "`listProducts()` does not trap during sorting/serialization for the existing default products.",
        "If `products.size() > 0`, `listProducts()` returns a non-empty array matching the stored products."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (compose around them if needed).",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding new product features (search, filters, categories) beyond fixing loading reliability.",
    "Changing authentication providers (must remain Internet Identity).",
    "Introducing external databases or non-IC backend infrastructure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}