{
  "kind": "build_request",
  "title": "Fix product catalog failing to load",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend public product listing so it reliably returns products without trapping and in a deterministic order.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "Calling the canister method `listProducts()` returns a non-empty `[Product]` list when default products exist.",
        "`listProducts()` does not trap for any current in-memory products state (including empty state).",
        "Products are returned in a consistent, deterministic order (e.g., sorted by product name)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the Products page error handling so users can recover when product loading fails, and the UI exposes actionable error details in English for troubleshooting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "When product loading fails, the Products page displays an English error state that includes the underlying error message (sanitized for display) in addition to the existing friendly text.",
        "The error state includes a Retry action that triggers a refetch and visibly indicates retry-in-progress.",
        "If the backend call succeeds after retry, the product grid renders without requiring a full page refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add lightweight diagnostics around product loading to help identify whether failures come from actor initialization or the `listProducts()` call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "UNABLE TO LOAD PRODUCTS"
        ]
      },
      "acceptanceCriteria": [
        "If actor initialization fails or is unavailable, the Products page shows a clear English message indicating the app could not connect to the backend.",
        "Console logs include a clear prefix (e.g., `ProductsPage:` / `useProducts:`) and the caught error for both actor initialization issues and `listProducts()` failures.",
        "No changes are made to any frontend files listed as immutable in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Only generate `backend/migration.mo` if a state upgrade is required; otherwise do not introduce migration changes.",
    "Do not edit any files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new product-management features beyond fixing loading reliability and diagnostics.",
    "Introducing external databases or third-party services for product storage or analytics.",
    "Changing the payment flow or admin order-notification features (unless directly required to resolve product loading)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}