{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve Products page resilience, error recovery, and diagnostics",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Enhance Products page error UI to show actionable English details, support retry with in-progress state, and recover without refresh.",
      "acceptanceCriteria": [
        "When product loading fails, the Products page displays an English error state that includes the underlying error message (sanitized for display) in addition to the existing friendly text.",
        "The error state includes a Retry action that triggers a refetch and visibly indicates retry-in-progress.",
        "If the backend call succeeds after retry, the product grid renders without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Update the error state UI to include a sanitized underlying error message in English (in addition to the friendly text), and ensure the Retry action clearly indicates retry-in-progress and triggers a refetch that can recover the grid without full refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/errorDisplay.ts",
          "operation": "create",
          "description": "Add a small utility to sanitize/normalize unknown errors into safe English display text (e.g., handle Error/strings/objects; strip noisy prefixes). Use this from ProductsPage and product-loading hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the products React Query hook to better support manual retry/refetch flows and expose enough state for the page to render retry-in-progress and recover cleanly after a successful refetch. Leverage the existing core-infrastructure actor wiring via useActor/createActorWithConfig. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add lightweight diagnostics to distinguish actor initialization failures from listProducts() call failures, with clear UI messaging and prefixed console logs.",
      "acceptanceCriteria": [
        "If actor initialization fails or is unavailable, the Products page shows a clear English message indicating the app could not connect to the backend.",
        "Console logs include a clear prefix (e.g., `ProductsPage:` / `useProducts:`) and the caught error for both actor initialization issues and `listProducts()` failures.",
        "No changes are made to any frontend files listed as immutable in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Expose actor initialization failure state (e.g., error/isError) to consumers and add prefixed console logging for actor creation/initialization failures (e.g., `useActor:`). Keep behavior compatible with existing core-infrastructure connection setup. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add prefixed console logging around the product-loading query function to distinguish between (a) actor unavailable/initialization issues and (b) listProducts() failures (e.g., `useProducts:`). Ensure the thrown errors remain suitable for sanitized display in the Products page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Use the actor initialization error state (from useActor/useProducts) to render a distinct English message for backend connection failure vs product-listing failure. Add prefixed console logs for page-level catches/branches (e.g., `ProductsPage:`). Ensure no edits are made to any immutable frontend paths per SYSTEM_CONTEXT. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}