{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Google Pay-only checkout payment to 9494237076 (remove UPI-ID)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove UPI-ID payee and make Google Pay (phone) the only/default payee in payment configuration.",
      "acceptanceCriteria": [
        "In frontend/src/config/payment.ts, PAYMENT_CONFIG.payees contains only one payee: id='gpay-phone', type='phone', value='9494237076'.",
        "PAYMENT_CONFIG.defaultPayeeId is set to 'gpay-phone' (or omitted while still defaulting to 'gpay-phone').",
        "No UPI ID payee (e.g., 'aliwaris@sbi') is present anywhere in the selectable options on the Checkout page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/payment.ts",
          "operation": "modify",
          "description": "Update PAYMENT_CONFIG to remove the UPI-ID option entirely and keep only the Google Pay phone payee (id='gpay-phone', type='phone', value='9494237076'); set defaultPayeeId to 'gpay-phone' and ensure label clearly indicates Google Pay. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace checkout payment selection with a Google Pay-only, copy-first payment UI (no payee dropdown, no UPI-ID validations).",
      "acceptanceCriteria": [
        "On frontend/src/pages/CheckoutPage.tsx, the payment section no longer renders a Select dropdown for payees.",
        "The payment section displays the payee label and phone number 9494237076 in a prominent, copy-friendly format.",
        "The payment section includes a 'Copy Google Pay Number' action that copies '9494237076' to the clipboard and provides visible confirmation (toast or inline message).",
        "The payment section includes a 'Copy Amount' action that copies the exact total amount (e.g., '₹123' or '123') to the clipboard and provides visible confirmation.",
        "Clicking the primary payment CTA does not call buildUpiDeepLink with a configuration that can produce the current error 'Phone numbers cannot be used for UPI payment links.'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Refactor the payment section to a Google Pay-only flow: remove the payee Select dropdown and selectedPayee switching; prominently display 'Google Pay' and the number 9494237076; add two copy actions (copy number + copy total amount) using clipboard API with visible confirmation (use existing toast system already used elsewhere). Remove/avoid UPI-ID-specific validation/error messaging and remove the Pay Now deep-link flow so buildUpiDeepLink is not invoked from the primary CTA. Continue using existing shadcn-ui building blocks already imported (Card, Button, Alert, etc.). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Preserve structured payment notes for Google Pay phone payee and ensure consistent rendering on order confirmation/details views (transaction reference optional).",
      "acceptanceCriteria": [
        "When an order is placed, the notes include a [PAYMENT_INFO] block produced by formatPaymentInfoForNotes with PayeeType='phone', PayeeLabel indicating Google Pay, and PayeeValue='9494237076'.",
        "On frontend/src/pages/OrderConfirmationPage.tsx, PaymentDetailsSection renders the Google Pay label and phone number when the order contains the structured payment info.",
        "On frontend/src/pages/OrderDetailsPage.tsx, payment details render consistently with Order Confirmation when structured payment info exists.",
        "The transaction reference field remains optional and, when provided, is shown in PaymentDetailsSection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Ensure order creation always writes structured Google Pay phone details by calling formatPaymentInfoForNotes with the Google Pay payee id (gpay-phone) and the optional transactionRef, independent of any removed payee selection UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/payment.ts",
          "operation": "modify",
          "description": "Harden formatPaymentInfoForNotes so it reliably includes PayeeType/PayeeLabel/PayeeValue for the Google Pay phone payee (e.g., defaulting to the configured default payee when payeeId is missing), and keep TransactionRef optional. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}