{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resilient product catalog loading with decoupled admin initialization and improved error recovery UX",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Decouple public product fetching from admin access-control initialization so `listProducts()` can succeed even if admin initialization fails.",
      "acceptanceCriteria": [
        "Opening the Products page successfully loads and renders the product list for an anonymous user.",
        "Opening the Products page successfully loads and renders the product list for an authenticated (Internet Identity) user even when `caffeineAdminToken` is missing or invalid.",
        "A failure in `_initializeAccessControlWithSecret` does not prevent React Query `useProducts()` from calling `actor.listProducts()`.",
        "Admin-only pages/controls still correctly require admin status; lack of admin initialization does not incorrectly grant admin access."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePublicActor.ts",
          "operation": "create",
          "description": "Create a dedicated hook that builds an actor suitable for public read-only calls (e.g., `listProducts()`), using Internet Identity when present but never hard-failing due to admin access-control initialization. It should expose clear state for (a) actor creation failures vs (b) admin-init failures that are intentionally ignored for public calls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useProducts()` to use the new public-actor hook instead of `useActor()` so product fetching is resilient to `_initializeAccessControlWithSecret` throwing/trapping. Ensure `useProducts()` can still run for both anonymous and authenticated users, and that admin-only hooks/guards continue to rely on existing admin-gated flows. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Confirm/adjust the admin guard behavior so that if admin initialization fails and admin status cannot be confirmed, admin routes remain denied (fail-closed) rather than accidentally allowing access. Keep the guard compatible with the existing `useIsAdmin()` behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure admin navigation visibility remains strictly dependent on confirmed admin status (no admin-init failure should show admin links). If needed, refine the logic that decides when to display admin UI so it never becomes truthy due to missing role data. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve Products page error diagnostics and retry UX with sanitized English messages and clear distinction between connection/actor failures vs `listProducts()` failures.",
      "acceptanceCriteria": [
        "When product loading fails, the Products page shows an English error title and description and displays `sanitizeError(error)` output.",
        "The Retry button triggers a refetch and properly transitions through a retrying/loading state without requiring a full page reload.",
        "Console logs for product fetch clearly indicate whether the failure occurred during actor initialization or during `listProducts()` execution."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errorDisplay.ts",
          "operation": "modify",
          "description": "Harden `sanitizeError(error)` to ensure output is safe, sanitized, and English-only for display (including redaction of obvious secret/token-like substrings and removal of noisy prefixes), while keeping the returned string stable for UI rendering. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Enhance `useProducts()` logging and error classification so console output clearly separates (1) actor creation/connection issues from (2) `listProducts()` execution failures. Ensure the hook exposes enough information for the Products page to render the correct error title/description. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Refine the error UI and recovery flow: keep all text in English, always show the sanitized error string from `sanitizeError(error)`, ensure Retry triggers React Query refetch and shows a retrying/loading transition, and display distinct messaging for backend connection/actor failures vs product-fetch failures. Use existing shadcn/ui components (e.g., Alert, Button, Skeleton) for consistent UX; do not modify `frontend/src/components/ui/*`. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}