{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Checkout enhancements: auto order details, online payment notes + deep link, and Rapido pickup helper",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Automatically show full details of the newly created order immediately after successful checkout, with clear recovery UI if details fail to load.",
      "acceptanceCriteria": [
        "When an order is successfully created from Checkout, the user is taken directly to a screen that shows full order details for the newly created order (customer info, address, items, total, and timestamp).",
        "The user does not need to type the order ID or click a secondary button to see the order details after placing an order.",
        "If the order details cannot be loaded, the UI shows a clear error state with a call-to-action to contact the business by phone and includes the order ID if available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OrderConfirmationPage.tsx",
          "operation": "modify",
          "description": "Update the confirmation screen to function as the immediate post-checkout full order details view: display timestamp alongside customer info/address/items/total, and strengthen the error state to include the route order ID (when available) plus a clear tap-to-call call-to-action. Use existing shadcn-ui primitives (Card/Alert/Button/etc.) for layout and messaging; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add required payment method selection to Checkout with an Online Payment deep link, optional transaction reference input, and append payment details into the order notes sent to createOrder.",
      "acceptanceCriteria": [
        "Checkout includes a required payment method choice (at minimum: \"Cash on Delivery\" and \"Online Payment\").",
        "If \"Online Payment\" is selected, the UI presents a clear \"Pay Now\" action via a deep link and an optional input for a payment reference/transaction ID.",
        "On order submission, the payment method and optional reference are appended to the notes payload sent to createOrder so it is visible on order confirmation/details screens.",
        "If online payment configuration details are missing (e.g., no payee configured), the UI gracefully informs the user and still allows placing the order with an appropriate note."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Extend the checkout form with a required payment method selection (Cash on Delivery vs Online Payment). When Online Payment is selected, show a \"Pay Now\" action that uses a deep link and an optional input for payment reference/transaction ID. On submit, append payment method + optional reference (and a \"not configured\" note when needed) into the notes string sent via the existing useCreateOrder call (no backend changes). Compose UI using existing shadcn-ui components already used on the page (Card/Button/Input/Label/Alert/etc.); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/config/payment.ts",
          "operation": "create",
          "description": "Add a small frontend-only configuration module for online payment details (e.g., payee VPA/UPI ID, payee name, optional fallback URL). This enables the UI to detect missing configuration and present the required graceful message while still allowing order placement."
        },
        {
          "path": "frontend/src/utils/payment.ts",
          "operation": "create",
          "description": "Create utilities to build an online payment deep link (e.g., UPI intent) from configured payee details and the computed order total, plus helpers to format the payment note text appended to the order notes."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Provide a post-order \"Book Rapido Pickup\" helper with deep link to Rapido and a copyable pickup note containing key order details.",
      "acceptanceCriteria": [
        "The post-order success screen shows a \"Book Rapido Pickup\" button/section.",
        "Clicking the button opens Rapido (at minimum via https://rapido.bike/ ) in a new tab/window.",
        "The UI provides a copy-to-clipboard action that copies a formatted pickup note containing at least: order ID, customer phone number, delivery address, and item list/quantities.",
        "This feature does not block normal checkout and is optional to use."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/OrderConfirmationPage.tsx",
          "operation": "modify",
          "description": "Add a \"Book Rapido Pickup\" section on the post-order confirmation/details screen: include a button that opens https://rapido.bike/ in a new tab/window and a copy-to-clipboard action that copies a formatted pickup summary derived from the loaded order (order ID, customer phone, address, and item list/quantities). Use existing shadcn-ui primitives (Button/Alert/Card/etc.) for UI structure and feedback; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/rapidoPickupNote.ts",
          "operation": "create",
          "description": "Add a formatter utility that generates the pickup text summary from an Order (including order ID, phone number, address, and item lines). This will be used by the confirmation page copy-to-clipboard action."
        }
      ]
    }
  ]
}